ZAG-UA/ESPEasy-mega-20230409-ESP32-C3-S3/src/src/ESPEasyCore/ESPEasyRules.cpp
/*
  if (f) {
    f.close();
  }
*/

  nestingLevel--;
  #ifndef BUILD_NO_RAM_TRACKER
  checkRAM(F("rulesProcessingFile2"));
  #endif // ifndef BUILD_NO_RAM_TRACKER
  backgroundtasks();
  return eventHandled; // && nestingLevel == 0;
}


/********************************************************************************************\
   Parse string commands
 \*********************************************************************************************/
bool get_next_inner_bracket(const String& line, int& startIndex, int& closingIndex, char closingBracket)
{
  if (line.length() <= 1) {
    // Not possible to have opening and closing bracket on a line this short.
    return false;
  }
  char openingBracket = closingBracket;

  switch (closingBracket) {
    case ']': openingBracket = '['; break;
    case '}': openingBracket = '{'; break;
    case ')': openingBracket = '('; break;
    default:
      // unknown bracket type
      return false;
  }
  // Closing bracket should not be found on the first position.
  closingIndex = line.indexOf(closingBracket, startIndex + 1);

  if (closingIndex == -1) { 
    // not found
    return false; 
  }

  for (int i = (closingIndex - 1); i > startIndex; --i) {
    if (line[i] == openingBracket) {
      startIndex = i;
      return true;
    }
  }
  return false;
}

bool get_next_argument(const String& fullCommand, int& index, String& argument, char separator)
{
  if (index == -1) {
    return false;
  }
  int newIndex = fullCommand.indexOf(separator, index);

  if (newIndex == -1) {
    argument = fullCommand.substring(index);
  } else {
    argument = fullCommand.substring(index, newIndex);
  }

  if (argument.startsWith(String(separator))) {
    argument = argument.substring(1);
  }

  //  addLog(LOG_LEVEL_INFO, String("get_next_argument: ") + String(index) + " " + fullCommand + " " + argument);
  index = newIndex;

  if (index != -1) {
    ++index;
  }
  return argument.length() > 0;
}

const char bitwise_functions[] PROGMEM = "bitread|bitset|bitclear|bitwrite|xor|and|or";
enum class bitwise_functions_e {
  bitread,
  bitset,
  bitclear,
  bitwrite,
  xor_e,  // protected keywords, thus appended _e
  and_e,
  or_e
};


bool parse_bitwise_functions(const String& cmd_s_lower, const String& arg1, const String& arg2, const String& arg3, int64_t& result) {
  #ifndef BUILD_NO_DEBUG
  if (loglevelActiveFor(LOG_LEVEL_DEBUG)) {
    String log = F("Bitwise: {");
    log += wrapIfContains(cmd_s_lower, ':', '\"');
    log += ':';
    log += wrapIfContains(arg1, ':', '\"');

    if (arg2.length() > 0) {
      log += ':';
      log += wrapIfContains(arg2, ':', '\"');

      if (arg3.length() > 0) {
        log += ':';
        log += wrapIfContains(arg3, ':', '\"');
      }
    }
    log += '}';
    addLogMove(LOG_LEVEL_DEBUG, log);
  }
  #endif

  if (cmd_s_lower.length() < 2) {
    return false;
  }

  char tmp[10]{};
  int command_i = GetCommandCode(tmp, sizeof(tmp), cmd_s_lower.c_str(), bitwise_functions);
  if (command_i == -1) {
    // No matching function found
    return false;
  }
  
  if (cmd_s_lower.startsWith(F("bit"))) {
    #define bitSetULL(value, bit) ((value) |= (1ULL << (bit)))
    #define bitClearULL(value, bit) ((value) &= ~(1ULL << (bit)))
    #define bitWriteULL(value, bit, bitvalue) (bitvalue ? bitSetULL(value, bit) : bitClearULL(value, bit))
#ifdef CONFIG_IDF_TARGET_ESP32C3
    unsigned int bitnr = 0;
#else
    uint32_t bitnr = 0;
#endif

    uint64_t iarg2 = 0;

    if (!validUIntFromString(arg1, bitnr) || !validUInt64FromString(arg2, iarg2)) {
      return false;
    }

    switch(static_cast<bitwise_functions_e>(command_i)) {
      case bitwise_functions_e::bitread:
        // Syntax like {bitread:0:123} to get a single decimal '1'
        result = bitRead(iarg2, bitnr);
        break;
      case bitwise_functions_e::bitset:
        // Syntax like {bitset:0:122} to set least significant bit of the given nr '122' to '1' => '123'
        result = iarg2;
        bitSetULL(result, bitnr);
        break;
      case bitwise_functions_e::bitclear:
        // Syntax like {bitclear:0:123} to set least significant bit of the given nr '123' to '0' => '122'
        result = iarg2;
        bitClearULL(result, bitnr);
        break;
      case bitwise_functions_e::bitwrite:
      {
#ifdef CONFIG_IDF_TARGET_ESP32C3
      unsigned int iarg3 = 0;
#else
        uint32_t iarg3 = 0;
#endif

        // Syntax like {bitwrite:0:122:1} to set least significant bit of the given nr '122' to '1' => '123'
        if (validUIntFromString(arg3, iarg3)) {
          const int bitvalue = (iarg3 & 1); // Only use the last bit of the given parameter
          result = iarg2;
          bitWriteULL(result, bitnr, bitvalue);
        } else {
          // Need 3 parameters, but 3rd one is not a valid uint
          return false;
        }
        break;
      }
      default: 
        return false;
    }

    // all functions starting with "bit" are checked
    return true;
  }

  uint64_t iarg1, iarg2 = 0;

  if (!validUInt64FromString(arg1, iarg1) || !validUInt64FromString(arg2, iarg2)) {
    return false;
  }

  switch(static_cast<bitwise_functions_e>(command_i)) {
    case bitwise_functions_e::xor_e:
      // Syntax like {xor:127:15} to XOR the binary values 1111111 and 1111 => 1110000
      result = iarg1 ^ iarg2;
      break;
    case bitwise_functions_e::and_e:
      // Syntax like {and:254:15} to AND the binary values 11111110 and 1111 => 1110
      result = iarg1 & iarg2;
      break;
    case bitwise_functions_e::or_e:
      // Syntax like {or:254:15} to OR the binary values 11111110 and 1111 => 11111111
      result = iarg1 | iarg2;
      break;
    default: 
      return false;

  }
  return true;
}

bool parse_math_functions(const String& cmd_s_lower, const String& arg1, const String& arg2, const String& arg3, double& result) {
  double farg1;
  float  farg2, farg3 = 0.0f;

  if (!validDoubleFromString(arg1, farg1)) {
    return false;
  }

  if (equals(cmd_s_lower, F("constrain"))) {
    // Contrain a value X to be within range of A to B
    // Syntax like {constrain:x:a:b} to constrain x in range a...b
    if (validFloatFromString(arg2, farg2) && validFloatFromString(arg3, farg3)) {
      if (farg2 > farg3) {
        const float tmp = farg2;
        farg2 = farg3;
        farg3 = tmp;
      }
      result = constrain(farg1, farg2, farg3);
    } else {
      return false;
    }
  } else {
    // No matching function found
    return false;
  }
  return true;
}

const char string_commands[] PROGMEM = "substring|indexof|indexof_ci|equals|equals_ci|timetomin|timetosec|strtol|tobin|tohex|ord|urlencode";
enum class string_commands_e {
  substring,
  indexof,
  indexof_ci,
  equals,
  equals_ci,
  timetomin,
  timetosec,
  strtol,
  tobin,
  tohex,
  ord,
  urlencode
};


void parse_string_commands(String& line) {
  int startIndex = 0;
  int closingIndex;

  bool mustReplaceMaskedChars = false;

