ZAG-UA/ESPEasy-mega-20230409-ESP32-C3-S3/src/src/ESPEasyCore/ESPEasyRules.cpp
  while (get_next_inner_bracket(line, startIndex, closingIndex, '}')) {
    // Command without opening and closing brackets.
    const String fullCommand = line.substring(startIndex + 1, closingIndex);
    const String cmd_s_lower = parseString(fullCommand, 1, ':');
    const String arg1        = parseStringKeepCaseNoTrim(fullCommand, 2, ':');
    const String arg2        = parseStringKeepCaseNoTrim(fullCommand, 3, ':');
    const String arg3        = parseStringKeepCaseNoTrim(fullCommand, 4, ':');

    if (cmd_s_lower.length() > 0) {
      String replacement; // maybe just replace with empty to avoid looping?
      uint64_t iarg1, iarg2 = 0;
      double   fresult = 0.0;
      int64_t  iresult = 0;
      int startpos, endpos = -1;
      const bool arg1valid = validIntFromString(arg1, startpos);
      const bool arg2valid = validIntFromString(arg2, endpos);

      if (parse_math_functions(cmd_s_lower, arg1, arg2, arg3, fresult)) {
        const bool trimTrailingZeros = true;
        replacement = doubleToString(fresult, maxNrDecimals_double(fresult), trimTrailingZeros);
      } else if (parse_bitwise_functions(cmd_s_lower, arg1, arg2, arg3, iresult)) {
        replacement = ull2String(iresult);
      } else {

        char tmp[12]{};
        int command_i = GetCommandCode(tmp, sizeof(tmp), cmd_s_lower.c_str(), string_commands);
        if (command_i != -1) {
          const string_commands_e command = static_cast<string_commands_e>(command_i);

          //      addLog(LOG_LEVEL_INFO, String(F("parse_string_commands cmd: ")) + cmd_s_lower + " " + arg1 + " " + arg2 + " " + arg3);

          switch (command) {
            case string_commands_e::substring:
              // substring arduino style (first char included, last char excluded)
              // Syntax like 12345{substring:8:12:ANOTHER HELLO WORLD}67890

              if (arg1valid
                  && arg2valid) {
                replacement = arg3.substring(startpos, endpos);
              }
              break;
            case string_commands_e::indexof:
            case string_commands_e::indexof_ci:
              // indexOf arduino style (0-based position of first char returned, -1 if not found, case sensitive), 3rd argument is search-offset
              // indexOf_ci : case-insensitive
              // Syntax like {indexof:HELLO:"ANOTHER HELLO WORLD"} => 8, {indexof:hello:"ANOTHER HELLO WORLD"} => -1, {indexof_ci:Hello:"ANOTHER HELLO WORLD"} => 8
              // or like {indexof_ci:hello:"ANOTHER HELLO WORLD":10} => -1

              if (!arg1.isEmpty()
                  && !arg2.isEmpty()) {
                unsigned int offset = 0;
                validUIntFromString(arg3, offset);
                if (command == string_commands_e::indexof_ci) {
                  String arg1copy(arg1);
                  String arg2copy(arg2);
                  arg1copy.toLowerCase();
                  arg2copy.toLowerCase();
                  replacement = arg2copy.indexOf(arg1copy, offset);
                } else {
                  replacement = arg2.indexOf(arg1, offset);
                }
              }
              break;
            case string_commands_e::equals:
            case string_commands_e::equals_ci:
              // equals: compare strings 1 = equal, 0 = unequal (case sensitive)
              // equals_ci: case-insensitive compare
              // Syntax like {equals:HELLO:HELLO} => 1, {equals:hello:HELLO} => 0, {equals_ci:hello:HELLO} => 1, {equals_ci:hello:BLA} => 0

              if (!arg1.isEmpty()
                  && !arg2.isEmpty()) {
                if (command == string_commands_e::equals_ci) {
                  replacement = arg2.equalsIgnoreCase(arg1);
                } else {
                  replacement = arg2.equals(arg1);
                }
              }
              break;
            case string_commands_e::timetomin:
            case string_commands_e::timetosec:
              // time to minutes, transform a substring hh:mm to minutes
              // time to seconds, transform a substring hh:mm:ss to seconds
              // syntax similar to substring

              if (arg1valid
                  && arg2valid) {
                int timeSeconds = 0;
                String timeString;
                if(timeStringToSeconds(arg3.substring(startpos, endpos), timeSeconds, timeString)) {
                  if (command == string_commands_e::timetosec) {
                    replacement = timeSeconds;
                  } else { // timetomin
                    replacement = timeSeconds / 60;
                  }
                }
              }
              break;
            case string_commands_e::strtol:
              // string to long integer (from cstdlib)
              // Syntax like 1234{strtol:16:38}7890
              if (validUInt64FromString(arg1, iarg1)
                  && validUInt64FromString(arg2, iarg2)) {
                replacement = String(strtoul(arg2.c_str(), nullptr, iarg1));
              }
              break;
            case string_commands_e::tobin:
              // Convert to binary string
              // Syntax like 1234{tobin:15}7890
              if (validUInt64FromString(arg1, iarg1)) {
                replacement = ull2String(iarg1, BIN);
              }
              break;
            case string_commands_e::tohex:
              // Convert to HEX string
              // Syntax like 1234{tohex:15}7890
              if (validUInt64FromString(arg1, iarg1)) {
                replacement = ull2String(iarg1, HEX);
              }
              break;
            case string_commands_e::ord:
              {
                // Give the ordinal/integer value of the first character of a string
                // Syntax like let 1,{ord:B}
                uint8_t uval = arg1.c_str()[0];
                replacement = String(uval);
              }
              break;
            case string_commands_e::urlencode:
              // Convert to url-encoded string
              // Syntax like {urlencode:"string to/encode"}
              if (!arg1.isEmpty()) {
                replacement = URLEncode(arg1);
              }
              break;
          }
        }
      }

      if (replacement.isEmpty()) {
        // part in braces is not a supported command.
        // replace the {} with other characters to mask the braces so we can continue parsing.
        // We have to unmask then after we're finished.
        // See: https://github.com/letscontrolit/ESPEasy/issues/2932#issuecomment-596139096
        replacement = line.substring(startIndex, closingIndex + 1);
        replacement.replace('{', static_cast<char>(0x02));
        replacement.replace('}', static_cast<char>(0x03));
        mustReplaceMaskedChars = true;
      }

      // Replace the full command including opening and closing brackets.
      line.replace(line.substring(startIndex, closingIndex + 1), replacement);

