ZAG-UA/ESPEasy-mega-20230409-ESP32-C3-S3/src/src/ESPEasyCore/ESPEasyRules.cpp
      /*
         if (replacement.length() > 0) {
         addLog(LOG_LEVEL_INFO, String(F("parse_string_commands cmd: ")) + fullCommand + String(F(" -> ")) + replacement);
         }
       */
    }
  }

  if (mustReplaceMaskedChars) {
    // We now have to check if we did mask some parts and unmask them.
    // Let's hope we don't mess up any Unicode here.
    line.replace(static_cast<char>(0x02), '{');
    line.replace(static_cast<char>(0x03), '}');
  }
}

void substitute_eventvalue(String& line, const String& event) {
  if (substitute_eventvalue_CallBack_ptr != nullptr) {
    substitute_eventvalue_CallBack_ptr(line, event);
  }

  if (line.indexOf(F("%event")) != -1) {
    if (event.charAt(0) == '!') {
      line.replace(F("%eventvalue%"), event); // substitute %eventvalue% with
                                              // literal event string if
                                              // starting with '!'
    } else {
      const int equalsPos = event.indexOf('=');

      String argString;

      if (equalsPos > 0) {
        argString = event.substring(equalsPos + 1);
      }

      // Replace %eventvalueX% with the actual value of the event.
      // For compatibility reasons also replace %eventvalue%  (argc = 0)
      line.replace(F("%eventvalue%"), F("%eventvalue1%"));
      int eventvalue_pos = line.indexOf(F("%eventvalue"));

      while (eventvalue_pos != -1) {
        const int percent_pos = line.indexOf('%', eventvalue_pos + 1);

        if (percent_pos == -1) {
          // Found "%eventvalue" without closing %
          if (loglevelActiveFor(LOG_LEVEL_ERROR)) {
            String log = F("Rules : Syntax error, missing '%' in '%eventvalue%': '");
            log += line;
            log += F("' %-pos: ");
            log += percent_pos;
            addLog(LOG_LEVEL_ERROR, log);
          }
          line.replace(F("%eventvalue"), F(""));
        } else {
          // Find the optional part for a default value when the asked for eventvalue does not exist.
          // Syntax: %eventvalueX|Y%
          // With: X = event value nr, Y = default value when eventvalue does not exist.
          String defaultValue('0');
          int or_else_pos = line.indexOf('|', eventvalue_pos);
          if ((or_else_pos == -1) || (or_else_pos > percent_pos)) {
            or_else_pos = percent_pos;
          } else {
            defaultValue = line.substring(or_else_pos + 1, percent_pos);
          }
          const String nr         = line.substring(eventvalue_pos + 11, or_else_pos);
          const String eventvalue = line.substring(eventvalue_pos, percent_pos + 1);
          int argc                = -1;

          if (equals(nr, '0')) {
            // Replace %eventvalue0% with the entire list of arguments.
            line.replace(eventvalue, argString);
          } else {
            argc = nr.toInt();
            
            // argc will be 0 on invalid int (0 was already handled)
            if (argc > 0) {
              String tmpParam;

              if (!GetArgv(argString.c_str(), tmpParam, argc)) {
                // Replace with default value for non existing event values
                tmpParam = parseTemplate(defaultValue);
              }
              line.replace(eventvalue, tmpParam);
            } else {
              // Just remove the invalid eventvalue variable
              if (loglevelActiveFor(LOG_LEVEL_ERROR)) {
                addLog(LOG_LEVEL_ERROR, concat(F("Rules : Syntax error, invalid variable: "), eventvalue));
              }
              line.replace(eventvalue, EMPTY_STRING);
            }
          }
        }
        eventvalue_pos = line.indexOf(F("%eventvalue"));
      }

      if ((line.indexOf(F("%eventname%")) != -1) ||
          (line.indexOf(F("%eventpar%")) != -1)) {
        const String eventName = equalsPos == -1 ? event : event.substring(0, equalsPos);

        // Replace %eventname% with the literal event
        line.replace(F("%eventname%"), eventName);

        // Part of %eventname% after the # char
        const int hash_pos = eventName.indexOf('#');
        line.replace(F("%eventpar%"), hash_pos == -1 ? EMPTY_STRING : eventName.substring(hash_pos + 1));
      }
    }
  }
}

void parseCompleteNonCommentLine(String& line, const String& event,
                                 String& action, bool& match,
                                 bool& codeBlock, bool& isCommand, bool& isOneLiner,
                                 bool condition[], bool ifBranche[],
                                 uint8_t& ifBlock, uint8_t& fakeIfBlock,
                                 bool   startOnMatched) {
  if (line.length() == 0) {
    return;
  }
  const bool lineStartsWith_on = line.substring(0, 3).equalsIgnoreCase(F("on "));

  if (!codeBlock && !match) {
    // We're looking for a new code block.
    // Continue with next line if none was found on current line.
    if (!lineStartsWith_on) {
      return;
    }
  }

  if (line.equalsIgnoreCase(F("endon"))) // Check if action block has ended, then we will
                                           // wait for a new "on" rule
  {
    isCommand   = false;
    codeBlock   = false;
    match       = false;
    ifBlock     = 0;
    fakeIfBlock = 0;
    return;
  }

  const bool lineStartsWith_pct_event = line.startsWith(F("%event"));;

  isCommand = true;

  if (match || !codeBlock) {
    // only parse [xxx#yyy] if we have a matching ruleblock or need to eval the
    // "on" (no codeBlock)
    // This to avoid wasting CPU time...
    if (match && !fakeIfBlock) {
      // substitution of %eventvalue% is made here so it can be used on if
      // statement too
      substitute_eventvalue(line, event);
    }

    if (match || lineStartsWith_on) {
      // Only parseTemplate when we are actually doing something with the line.
      // When still looking for the "on ... do" part, do not change it before we found the block.
      line = parseTemplate(line);
    }
  }


  if (!codeBlock) // do not check "on" rules if a block of actions is to be
                  // processed
  {
    action.clear();
    if (lineStartsWith_on) {
      ifBlock     = 0;
      fakeIfBlock = 0;

