ZAG-UA/ESPEasy-mega-20230409-ESP32-C3-S3/src/src/ESPEasyCore/ESPEasyRules.cpp
  #ifndef BUILD_NO_DEBUG

  if (loglevelActiveFor(LOG_LEVEL_DEBUG)) {
    String log = F("conditionMatch: ");
    log += wrap_String(check, '"');
    log += F(" --> ");

    log += wrap_String(tmpCheck1, '"');
    log += wrap_String(check.substring(posStart, posEnd), ' '); // Compare
    log += wrap_String(tmpCheck2, '"');

    log += F(" --> ");
    log += boolToString(result);
    log += ' ';

    log += '(';
    const bool trimTrailingZeros = true;
    log += compareTimes ? String(timeInSec1) : doubleToString(Value1, 6, trimTrailingZeros);
    log += wrap_String(check.substring(posStart, posEnd), ' '); // Compare
    log += compareTimes ? String(timeInSec2) : doubleToString(Value2, 6, trimTrailingZeros);
    log += ')';
    addLogMove(LOG_LEVEL_DEBUG, log);
  }
  #else // ifndef BUILD_NO_DEBUG
  (void)compareTimes; // To avoid compiler warning
  #endif // ifndef BUILD_NO_DEBUG
  return result;
}

/********************************************************************************************\
   Generate rule events based on task refresh
 \*********************************************************************************************/
void createRuleEvents(struct EventStruct *event) {
  if (!Settings.UseRules) {
    return;
  }
  const deviceIndex_t DeviceIndex = getDeviceIndex_from_TaskIndex(event->TaskIndex);

  if (!validDeviceIndex(DeviceIndex)) { return; }

  #ifdef USE_SECOND_HEAP
//  HeapSelectIram ephemeral;  
// TD-er: Disabled for now, suspect for causing crashes
  #endif

  const uint8_t valueCount = getValueCountForTask(event->TaskIndex);

  // Small optimization as sensor type string may result in large strings
  // These also only yield a single value, so no need to check for combining task values.
  if (event->sensorType == Sensor_VType::SENSOR_TYPE_STRING) {
    size_t expectedSize = 2 + getTaskDeviceName(event->TaskIndex).length();
    expectedSize += getTaskValueName(event->TaskIndex, 0).length();
   
    bool appendCompleteStringvalue = false;
    String eventString;

    if (eventString.reserve(expectedSize + event->String2.length())) {
      appendCompleteStringvalue = true;
    } else if (!eventString.reserve(expectedSize + 24)) {
      // No need to continue as we can't even allocate the event, we probably also cannot process it
      addLog(LOG_LEVEL_ERROR, F("Not enough memory for event"));
      return;
    }
    eventString += getTaskDeviceName(event->TaskIndex);
    eventString += '#';
    eventString += getTaskValueName(event->TaskIndex, 0);
    eventString += '=';
    eventString += '`';
    if (appendCompleteStringvalue) {
      eventString += event->String2;
    } else {
      eventString += event->String2.substring(0, 10);
      eventString += F("...");
      eventString += event->String2.substring(event->String2.length() - 10);
    }
    eventString += '`';
    eventQueue.addMove(std::move(eventString));    
  } else if (Settings.CombineTaskValues_SingleEvent(event->TaskIndex)) {
    String eventvalues;
    eventvalues.reserve(32); // Enough for most use cases, prevent lots of memory allocations.

    for (uint8_t varNr = 0; varNr < valueCount; varNr++) {
      if (varNr != 0) {
        eventvalues += ',';
      }
      eventvalues += formatUserVarNoCheck(event, varNr);
    }
    eventQueue.add(event->TaskIndex, F("All"), eventvalues);
  } else {
    for (uint8_t varNr = 0; varNr < valueCount; varNr++) {
      eventQueue.add(event->TaskIndex, getTaskValueName(event->TaskIndex, varNr), formatUserVarNoCheck(event, varNr));
    }
  }
}
